import Image from "next/image";
import { EstedadBold } from "@/app/Fonts";



export default function AboutUs() {
	
	
	return (
		<div className="container">
			<h2
				className="text-2xl text-text ${EstedadBold} mt-10 mb-5 leading-[140%]"
			>
				درباره‌ما
			</h2>
			
			<div
				className="flex justify-between items-start"
			>
				<div
					className="xl:w-1/2 text-[#717171] text-lg md:text-xl [&>*]:leading-[180%]"
				>
					<p className="hidden sm--md:inline">
						رستوران‌های زنجیره‌ای ترخینه در سال ۱۳۶۸ افتتاح گردیده‌اند و در طی این سال‌ها همواره با ارائه غذاهای باکیفیت و سرویس سریع و به موقع در تلاش برای جلب رضایت مشتریان خود بوده‌اند. در طی این سال‌ها اولیت جلب رضایت مشتریان بوده است.
					</p>
					
					<p className="hidden lg:inline">
						دراین خصوص ترخینه همیشه در تلاش بوده تا در طی این زمان‌ها کیفیت غذاهای خودرا در بهترین حالت نگه داشته و حتی با نوسانات قیمت‌های مواد اولیه در بازار قیمت خود را ثابت نگه داشته است.
					</p>
					
					<p className="hidden lg--xl:inline">
						ترخینه شعبات خود را افتتاح کرده که بسیار شیک و مدرن می‌باشند و برای برگزاری جشن‌های کوچک و بزرگ شما مشتریان عزیز توانایی پذیرایی با کیفیت بالا را دارند. سالن پذیرایی شعبات در دو طبقه مجزا به همراه راه پله مدرن و آسانسور برای افراد کم‌توان و سالخورده آماده ارائه سرویس به شما عزیزان می‌باشند.
					</p>
					
					<p className="hidden xl--2xl:inline">
						چشم انداز: در آینده‌ای نزدیک تالار پذیرایی شعبات راه اندازی شده و آماده برگزاری جشن‌ها و مراسم‌های بزرگ شما خواهند بود . به امید آن روز که همه ایرانیان سالم و سلامت باشند.
					</p>
				</div>
				
				<Image
					width="600"
					height="492"
					src="/images/about-us-main-img.jpg"
					alt="about-us-main-img"
					className={`sm--md:mr-5 mb-2
					w-full sm--md:w-1/2 xl:w-[600px] xl:h-[492px]`}
				/>
			</div>
			
			<div
				className="text-[#717171] text-lg md:text-xl [&>*]:leading-[180%] "
			>
				
				<p className="inline sm--md:hidden">
					رستوران‌های زنجیره‌ای ترخینه در سال ۱۳۶۸ افتتاح گردیده‌اند و در طی این سال‌ها همواره با ارائه غذاهای باکیفیت و سرویس سریع و به موقع در تلاش برای جلب رضایت مشتریان خود بوده‌اند. در طی این سال‌ها اولیت جلب رضایت مشتریان بوده است.
				</p>
				
				<p className="inline lg:hidden">
					دراین خصوص ترخینه همیشه در تلاش بوده تا در طی این زمان‌ها کیفیت غذاهای خودرا در بهترین حالت نگه داشته و حتی با نوسانات قیمت‌های مواد اولیه در بازار قیمت خود را ثابت نگه داشته است.
				</p>
				
				<p className="inline lg--xl:hidden">
					ترخینه شعبات خود را افتتاح کرده که بسیار شیک و مدرن می‌باشند و برای برگزاری جشن‌های کوچک و بزرگ شما مشتریان عزیز توانایی پذیرایی با کیفیت بالا را دارند. سالن پذیرایی شعبات در دو طبقه مجزا به همراه راه پله مدرن و آسانسور برای افراد کم‌توان و سالخورده آماده ارائه سرویس به شما عزیزان می‌باشند.
				</p>
				
				<p className="xl--2xl:hidden">
					چشم انداز: در آینده‌ای نزدیک تالار پذیرایی شعبات راه اندازی شده و آماده برگزاری جشن‌ها و مراسم‌های بزرگ شما خواهند بود . به امید آن روز که همه ایرانیان سالم و سلامت باشند.
				</p>
				
			</div>
		</div>
	)
}