import { Button } from "ui/Button";
import { Separator } from "ui/Separator";



export default function Address() {
	
	
	const flag = true;
	
	return (
		
		<div
			className="border w-full h-[205px] mb-4 rounded-lg p-3 pt-0 sm:px-6 sm:py-4 flex flex-col"
		>
			<div className="flex justify-between items-center">
				<h5 className="flex justify-between items-center">
					<svg className="ml-1" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M12 14.6699C9.87 14.6699 8.13 12.9399 8.13 10.7999C8.13 8.65994 9.87 6.93994 12 6.93994C14.13 6.93994 15.87 8.66994 15.87 10.8099C15.87 12.9499 14.13 14.6699 12 14.6699ZM12 8.43994C10.7 8.43994 9.63 9.49994 9.63 10.8099C9.63 12.1199 10.69 13.1799 12 13.1799C13.31 13.1799 14.37 12.1199 14.37 10.8099C14.37 9.49994 13.3 8.43994 12 8.43994Z" fill="#353535"/>
						<path d="M12 23.26C10.52 23.26 9.02999 22.7 7.86999 21.59C4.91999 18.75 1.65999 14.22 2.88999 8.83C3.99999 3.94 8.26999 1.75 12 1.75C12 1.75 12 1.75 12.01 1.75C15.74 1.75 20.01 3.94 21.12 8.84C22.34 14.23 19.08 18.75 16.13 21.59C14.97 22.7 13.48 23.26 12 23.26ZM12 3.25C9.08999 3.25 5.34999 4.8 4.35999 9.16C3.27999 13.87 6.23999 17.93 8.91999 20.5C10.65 22.17 13.36 22.17 15.09 20.5C17.76 17.93 20.72 13.87 19.66 9.16C18.66 4.8 14.91 3.25 12 3.25Z" fill="#353535"/>
					</svg>
					آدرس‌ها
				</h5>
				
				<Button className="text-primary text-xs bg-white hover:bg-white p-0 m-0">
					
					<svg className="ml-0.5" width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M6.24611 16.3813C3.45068 13.5858 3.45068 9.04149 6.24611 6.24607C9.04154 3.45064 13.5859 3.45064 16.3813 6.24607C19.1767 9.04149 19.1767 13.5858 16.3813 16.3813C13.5859 19.1767 9.04154 19.1767 6.24611 16.3813ZM15.6742 6.95317C13.27 4.54901 9.35738 4.54901 6.95321 6.95317C4.54905 9.35734 4.54905 13.27 6.95321 15.6742C9.35738 18.0783 13.27 18.0783 15.6742 15.6742C18.0784 13.27 18.0784 9.35734 15.6742 6.95317Z" fill="#417F56"/>
						<path d="M8.292 11.6674C8.20244 11.5778 8.14587 11.4552 8.14587 11.3138C8.14587 11.0404 8.37214 10.8141 8.64556 10.8141H13.9819C14.2553 10.8141 14.4815 11.0404 14.4815 11.3138C14.4815 11.5872 14.2553 11.8135 13.9819 11.8135H8.64556C8.50885 11.8182 8.38157 11.7569 8.292 11.6674Z" fill="#417F56"/>
						<path d="M10.9602 14.3355C10.8706 14.246 10.814 14.1234 10.814 13.982L10.814 8.64567C10.814 8.37225 11.0403 8.14598 11.3137 8.14598C11.5871 8.14598 11.8134 8.37225 11.8134 8.64567L11.8134 13.982C11.8134 14.2554 11.5871 14.4817 11.3137 14.4817C11.1723 14.4817 11.0497 14.4251 10.9602 14.3355Z" fill="#417F56"/>
					</svg>
					افزودن آدرس
					
				</Button>
			</div>
			
			<Separator className="bg-[#cbcbcb] my-3" />
			
			{
				flag ? (
					
					<div className="rounded-lg border bg-[#f9f9f9] px-2 py-4 sm:p-4 text-center">
						
						<p className="text-xs sm:text-sm lg:text-base">
							تهران: اقدسیه، بزرگراه ارتش، مجتمع شمیران سنتر، طبقه ۱۰
						</p>
						
						<div
							className={`flex justify-between items-center text-[10px] leading-[180%] xs--sm:text-xs
							text-[#717171] mt-4`}
						>
							
							<p className="">
								محل کار
							</p>
							
							<p className="">
								سردار وظیفه
							</p>
							
							<p className="ltr">
								۰۹۱۴ ۸۶۴ ۳۳۵۰
							</p>
							
						</div>
						
					</div>
					
				) : (
					<p className="text-center h-full flex justify-items">
						ادرس خود را وارد کنید.
					</p>
				)
			}
			
		</div>
	)
}